
## Plan Result (terraform/aws/openhands)

[CI link](https://github.com/boxp/arch/actions/runs/13760372243)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.ssm_reader_access_key_id
  * aws_ssm_parameter.ssm_reader_secret_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.ssm_reader_access_key_id will be created
  + resource "aws_ssm_parameter" "ssm_reader_access_key_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AWS Access Key ID for SSM Parameter Reader"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "ssm-reader-access-key-id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.ssm_reader_secret_access_key will be created
  + resource "aws_ssm_parameter" "ssm_reader_secret_access_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "AWS Secret Access Key for SSM Parameter Reader"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "ssm-reader-secret-access-key"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":2894,"Program":"tfcmt","SHA1":"1fb37d4174c0ad858e72dea3a8d08ae5a8d94d70","Target":"terraform/aws/openhands","Vars":{},"WorkflowName":"pull_request_target"} -->